payment/data/src/test/resources/GET/payments/v4/subscription.json

{
  "Code": 1000,
  "Subscription": {
    "ID": "dM7tIbqARP2pnfphQaa9xDOEKHUo5Z5DCPj-dIM8g44xHRgDTg3aREOV2NzIiemcT-TZzCZH1HARpdzs_FGjLA==",
    "InvoiceID": "hrPCvvOu8LcIynTI1ERjaNAubwFodwyVw7skYynSfbsWJ3DGuqFtQB1ut0spmFYaTcIqUfTXSoriTGa-30ooaA==",
    "Cycle": 12,
    "PeriodStart": 1575237692,
    "PeriodEnd": 1606860092,
    "CouponCode": null,
    "Currency": "EUR",
    "Amount": 4788,
    "Discount":0,
    "RenewDiscount":0,
    "RenewAmount":4788,
    "Plans": [
      {
        "ID": "Wb4NAqmiuqoA7kCHE28y92bBFfN8jaYQCLxHRAB96yGj-bh9SxguXC48_WSU-fRUjdAr-lx95c6rFLplgXyXYA==",
        "ParentMetaPlanID": "hUcV0_EeNwUmXA6EoyNrtO-ZTD8H8F6LvNaSjMaPxB5ecFkA7y-5kc3q38cGumJENGHjtSoUndkYFUx0_xlJeg==",
        "Type": 1,
        "Name": "mail2022",
        "Title": "Mail Plus",
        "MaxDomains": 1,
        "MaxAddresses": 10,
        "MaxCalendars": 20,
        "MaxSpace": 16106127360,
        "MaxMembers": 1,
        "MaxVPN": 0,
        "MaxTier": 0,
        "Services": 1,
        "Features": 1,
        "State": 1,
        "Pricing": {
          "1": 499,
          "12": 4788,
          "24": 8376
        },
        "PeriodEnd": {
          "1": 1666521589,
          "12": 1695465589,
          "24": 1727087989
        },
        "Currency": "CHF",
        "Quantity": 1,
        "Cycle": 1,
        "Amount": 499
      }
    ],
    "External": 2,
    "CustomerID": "customer-1"
  }
}
