payment/data/src/test/resources/POST/payments/v4/subscription.json

{
  "Code": 1000,
  "Subscription": {
    "ID": "AFkwocc2w1kxeQrJ6lDfeUAvHfWK4whzlgkJ5VB2RoeS4JGmVZIM9GtHsFPPOZfstzlagtv4lY3l-Rv_R8vdDg==",
    "InvoiceID": "vkv3EQ9WaLjWyMFdUgvJo-9nbgJeaQ5jnHPAAutN1d8JQp9j-MVwDQtD7EhWoakj2bgYvwvIjoRAebSrSwCebw==",
    "Cycle": 12,
    "PeriodStart": 1663940037,
    "PeriodEnd": 1695476037,
    "CreateTime": 1663940037,
    "CouponCode": null,
    "Currency": "CHF",
    "Amount": 4788,
    "Discount": 0,
    "RenewDiscount": 0,
    "RenewAmount": 4788,
    "Plans": [
      {
        "ID": "Wb4NAqmiuqoA7kCHE28y92bBFfN8jaYQCLxHRAB96yGj-bh9SxguXC48_WSU-fRUjdAr-lx95c6rFLplgXyXYA==",
        "ParentMetaPlanID": "hUcV0_EeNwUmXA6EoyNrtO-ZTD8H8F6LvNaSjMaPxB5ecFkA7y-5kc3q38cGumJENGHjtSoUndkYFUx0_xlJeg==",
        "Type": 1,
        "Name": "mail2022",
        "Title": "Mail Plus",
        "MaxDomains": 1,
        "MaxAddresses": 10,
        "MaxCalendars": 20,
        "MaxSpace": 16106127360,
        "MaxMembers": 1,
        "MaxVPN": 0,
        "MaxTier": 0,
        "Services": 1,
        "Features": 1,
        "State": 1,
        "Cycle": 12,
        "Currency": "CHF",
        "Amount": 4788,
        "Quantity": 1
      }
    ],
    "Renew": 1,
    "External": 2
  }
}
